# dictionaries.py

WORD_NUMS = {
    "शून्य": 0, "एक": 1, "दो": 2, "तीन": 3, "चार": 4, "पाँच": 5,
    "छह": 6, "सात": 7, "आठ": 8, "नौ": 9, "दस": 10,
    "ग्यारह": 11, "बारह": 12, "तेरह": 13, "चौदह": 14, "पंद्रह": 15,
    "सोलह": 16, "सत्रह": 17, "अठारह": 18, "उन्नीस": 19, "बीस": 20,
    "इक्कीस": 21, "बाइस": 22, "तेईस": 23, "चौबीस": 24, "पच्चीस": 25,
    "छब्बीस": 26, "सत्ताइस": 27, "अट्ठाइस": 28, "उनतीस": 29, "तीस": 30,
    "इकत्तीस": 31, "बत्तीस": 32, "तैंतीस": 33, "चौंतीस": 34, "पैंतीस": 35,
    "छत्तीस": 36, "सैंतीस": 37, "अड़तीस": 38, "उनतालीस": 39, "चालीस": 40,
    "इकतालीस": 41, "बयालीस": 42, "तैंतालीस": 43, "चवालीस": 44, "पैंतालीस": 45,
    "छियालीस": 46, "सैंतालीस": 47, "अड़तालीस": 48, "उनचास": 49, "पचास": 50,
    "इक्यावन": 51, "बावन": 52, "तिरेपन": 53, "चौवन": 54, "पचपन": 55,
    "छप्पन": 56, "सत्तावन": 57, "अट्ठावन": 58, "उनसठ": 59, "साठ": 60,
    "इकसठ": 61, "बासठ": 62, "तिरसठ": 63, "चौंसठ": 64, "पैंसठ": 65,
    "छियासठ": 66, "सड़सठ": 67, "अड़सठ": 68, "उनहत्तर": 69, "सत्तर": 70,
    "इकहत्तर": 71, "बहत्तर": 72, "तिहत्तर": 73, "चौहत्तर": 74, "पचहत्तर": 75,
    "छिहत्तर": 76, "सत्तहत्तर": 77, "अठहत्तर": 78, "उनासी": 79, "अस्सी": 80,
    "इक्यासी": 81, "बयासी": 82, "तिरासी": 83, "चौरासी": 84, "पचासी": 85,
    "छियासी": 86, "सत्तासी": 87, "अठासी": 88, "नवासी": 89, "नब्बे": 90,
    "इक्यानबे": 91, "बानबे": 92, "तिरानबे": 93, "चौरानबे": 94, "पचानबे": 95,
    "छियानबे": 96, "सत्तानबे": 97, "अट्ठानबे": 98, "निन्यानबे": 99, "सौ": 100
}

OPERATIONS = {
    "add": ["जोड़ो", "जोडो", "जोडों" "जोड़", "प्लस", "जोड़ों"],
    "subtract": ["घटा", "माइनस", "घटाओ", "कम"],
    "multiply": ["गुना", "इंटू", "बार", "गुणा",],
    "divide": ["भाग", "डिवाइड", "बटा"]
}

DATE_KEYWORDS = {
    "today": ["आज", "today"],
    "tomorrow": ["कल", "tomorrow"],
    "day_after_tomorrow": ["परसों", "day after tomorrow"]
}

DAYS = {
    "Monday": "सोमवार",
    "Tuesday": "मंगलवार",
    "Wednesday": "बुधवार",
    "Thursday": "गुरुवार",
    "Friday": "शुक्रवार",
    "Saturday": "शनिवार",
    "Sunday": "रविवार"
}

MONTHS = {
    "January": "जनवरी",
    "February": "फरवरी",
    "March": "मार्च",
    "April": "अप्रैल",
    "May": "मई",
    "June": "जून",
    "July": "जुलाई",
    "August": "अगस्त",
    "September": "सितंबर",
    "October": "अक्टूबर",
    "November": "नवंबर",
    "December": "दिसंबर"
}

TIME_SCHEMA = {
    "mode": {
        "alarm": ["अलार्म", "जगा", "उठाना", "अलर्ट", "रिमाइंडर", "अलाराम"],
        "timer": ["टाइमर", "गिनती", "काउंटडाउन", "रुकना"],
        "current_time": ["समय", "टाइम", "बज", "बजे", "वक़्त", "घड़ी", "क्या"]
    },
    "units": {
        "hour": ["घंटे", "घंटा", "आवर", "hour"],
        "minute": ["मिनट", "मिंट", "minute", "min"],
        "second": ["सेकंड", "सेकेंड", "सेकण्ड", "second"]
    }
}

AM_KEYWORDS = [
    "सुबह", "सवेरे", "तड़के", "मॉर्निंग", 
    "am", "a.m", "ए.एम", "एएम"
]

PM_KEYWORDS = [
    "शाम", "रात", "दोपहर", "इवनिंग", "नाइट", 
    "pm", "p.m", "पी.एम", "पीएम"
]